app/Controllers/BaseController.php

	protected function getUserData() {
		if (isset($this->data['userdata'])) {
			return $this->data['userdata'];
		}

		try {
			if ($this->isUserLoggedIn()) {

				$userModel = model('UserModel');
				$data = $userModel->where('id', session('id'))->first();
---
SELECT *
FROM `user`
WHERE `id` = '1'
 LIMIT 1