app/Models/UserModel.php

	public function getPlayers() {
		return $this->db->table('user_elo')->get()->getResultArray();
---
SELECT *
FROM `user_elo`

	public function getPlayer($id) {
		$query = $this->db->table('user')->select('user.*, user_elo.elo')->where('user.id', $id)->join('user_elo', 'user.id = user_elo.id');
---
SELECT `user`.*, `user_elo`.`elo`
FROM `user`
JOIN `user_elo` ON `user`.`id` = `user_elo`.`id`
WHERE `user`.`id` = '2'